//Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// Console.WriteLine("Введите число");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число");
// int b = Convert.ToInt32(Console.ReadLine());

// if(a > b)
// {
//     Console.WriteLine("Maximum is" + " " + a);

// }
// else
// {
//     Console.WriteLine("Maximum is" + " " + b);
// }


//Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих

// Console.WriteLine("Введите первое число");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число");
// int b = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите третье число");
// int c = Convert.ToInt32(Console.ReadLine());
// int max = a;

// if(b > max)
// {
//     max = b;
// }

// if(c > max)
// {
//    max = c; 
// }

// Console.WriteLine("Maximum is" + " " + max);
